app/services/gist_question_service.rb

SELECT "answers"."body" FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 4]]
---
	def gist_content
    content = [@question.body]
		#выбираем каждый ответ и записываем в массив
		content += @question.answers.pluck(:body)