app/controllers/admin/badges_controller.rb

SELECT "badges".* FROM "badges"
---
  def index
    @badges = Badge.all

UPDATE "badges" SET "label" = $1, "message" = $2, "updated_at" = $3 WHERE "badges"."id" = $4  [["label", "1"], ["message", "Hi"], ["updated_at", "2022-04-08 21:56:26.337535"], ["id", 1]]
UPDATE "badges" SET "full_url" = $1, "updated_at" = $2 WHERE "badges"."id" = $3  [["full_url", "https://img.shields.io/static/v1?color=red&label&logo=streamlit&logoColor=gold&message=Jojojo"], ["updated_at", "2022-04-08 21:53:46.582419"], ["id", 1]]
---
  def update
    shield_service = ShieldsService.new(badge_params)
    response = shield_service.call
    #byebug
    if @badge.update(badge_params)
      @badge.update(full_url: response.env.url)

SELECT "badges".* FROM "badges" WHERE "badges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_badge
    @badge = Badge.find(params[:id])