app/controllers/admin/questions_controller.rb

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "tmltmtbtmlmlmmmm"], ["updated_at", "2022-04-08 17:26:57.819251"], ["id", 10]]

  def find_test
    @test = Test.find(params[:test_id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def find_question
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]