app/controllers/admin/tests_controller.rb

SELECT "tests".* FROM "tests"
---
  def index
    @tests = Test.all.sort

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_test
    @test = Test.find(params[:id])