app/views/test_passages/result.html.erb

<h2><%= t('.correct', correct: @test_passage.correct_questions) %></h2>
<h2><%= t('.total_questions', questions_count: @test_passage.test.questions.count) %></h2>
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 24]]