app/views/test_passages/show.html.erb

</b>
<p> <%= t('.questions', questions: @test_passage.test.questions.count) %></p>
---
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1 AND (id > 14) ORDER BY "questions"."id" ASC LIMIT $2  [["test_id", 24], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 24]]