app/controllers/answers_controller.rb

  def create
    #@queanswers = Answer.new(answer_params)
    @answer = @question.answers.new(answer_params)
    if @answer.save
---
INSERT INTO "answers" ("correct", "body", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["correct", true], ["body", "12334"], ["question_id", 14], ["created_at", "2022-02-12 09:15:44.688050"], ["updated_at", "2022-02-12 09:15:44.688050"]]

    def find_question
      @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]