app/controllers/tests_controller.rb

  def start
    if @test.questions.empty?
---
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 23]]
SELECT 1 AS one FROM "questions" WHERE "questions"."test_id" = $1 LIMIT $2  [["test_id", 5], ["LIMIT", 1]]

  def find_test
    @test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]