app/controllers/test_passages_controller.rb

SELECT "test_passages".* FROM "test_passages" WHERE "test_passages"."id" = $1 LIMIT $2  [["id", 173], ["LIMIT", 1]]
---
   def set_test_passage
     @test_passage = TestPassage.find(params[:id])

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
   def test_right_answers_count
     @right_answers = @test_passage.test.questions.map