app/controllers/tests_controller.rb

  def index
    @tests = Test.all
---
SELECT "tests".* FROM "tests" ORDER BY "tests"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def start
    #@user.tests.push(@test)
    @current_user.tests.push(@test)
---
INSERT INTO "tests" ("category_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["category_id", 18], ["created_at", "2022-02-04 13:00:56.019043"], ["updated_at", "2022-02-04 13:00:56.019043"]]

  def create
    @test = Test.new(test_params)

    if @test.save
---
INSERT INTO "tests" ("level", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["level", 16], ["category_id", 18], ["created_at", "2022-02-05 13:54:33.198323"], ["updated_at", "2022-02-05 13:54:33.198323"]]

  def update
    if @test.update(test_params)
---
UPDATE "tests" SET "title" = $1, "level" = $2, "category_id" = $3, "updated_at" = $4 WHERE "tests"."id" = $5  [["title", "Grammar"], ["level", 5], ["category_id", 16], ["updated_at", "2022-02-04 13:09:34.365386"], ["id", 28]]

  def destroy
    @test.destroy
---
DELETE FROM "tests" WHERE "tests"."id" = $1  [["id", 28]]

  def find_test
    @test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def set_user
    @user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]