app/models/answer.rb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 14]]
---
    def right_answers_count
      errors.add(:answer, "The number of answers cannot be more than 4. Answers full.") if self.question.answers.count >= 4