app/models/test_passage.rb

SELECT "test_passages".* FROM "test_passages" ORDER BY "test_passages"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def correct_answer?(answer_ids)
    correct_answers.ids.sort == answer_ids.map(&:to_i).sort

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 5]]
---
  def questions_counter
    @count = self.test.questions.order(:id).where('id < ?', current_question.id).count + 1

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["test_id", 24], ["LIMIT", 1]]
---
  def before_validation_set_first_question
    self.current_question = test.questions.order(:id).first if test.present?

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["test_id", 24], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def next_question
    self.current_question = test.questions.order(:id).where('id > ?', current_question.id).first