app/views/admin/tests/_test.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 3]]
---
  <td> <%= test_level(test) %> </td>
  <td><%= test.questions.count %></td>