app/views/tests/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."title" DESC
---
    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :title, prompt: true %>