app/views/tests/_test.html.erb

  <td> <%= test_level(test) %> </td>
  <td><%= test.questions.count %></td>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 24]]